Revit 2027 API
RibbonItemEventArgs Constructor
Initializes a new instance of the RibbonItemEventArgs class
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RibbonItemEventArgs()
Public Sub New
public:
RibbonItemEventArgs()
new : unit -> RibbonItemEventArgs
See Also
Reference
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace